GreatCowBASIC/DATFileGenerator/incfiles/p16F13123.inc
        LIST
;==========================================================================
;
;  Built by Great Cow BASIC convertor
;  MPASM processor include for the chip shown below
;
; C:\Users\admin\.mchp_packs\index.idx
; C:\Users\admin\.mchp_packs\Microchip\PIC16F1xxxx_DFP\1.25.389\xc8\pic\dat\ini\16F13123.ini
; C:\Users\admin\.mchp_packs\Microchip\PIC16F1xxxx_DFP\1.25.389\edc\PIC16F13123.PIC
; C:\Users\admin\.mchp_packs\Microchip\PIC16F1xxxx_DFP\1.25.389\xc8\pic\dat\cfgdata\16F13123.cfgdata
;
;==========================================================================
        NOLIST
        IFNDEF __16F13123
           MESSG "Processor-header file mismatch.  Verify selected processor."
        ENDIF
;==========================================================================
;
;       Register Definitions
;
;==========================================================================

;----- Register Files -----------------------------------------------------

;-----Bank0------------------
INDF0            EQU  H'0000'
INDF1            EQU  H'0001'
PCL              EQU  H'0002'
STATUS           EQU  H'0003'
FSR0             EQU  H'0004'
FSR0L            EQU  H'0004'
FSR0H            EQU  H'0005'
FSR1             EQU  H'0006'
FSR1L            EQU  H'0006'
FSR1H            EQU  H'0007'
BSR              EQU  H'0008'
WREG             EQU  H'0009'
PCLATH           EQU  H'000A'
INTCON           EQU  H'000B'
PORTA            EQU  H'000C'
PORTC            EQU  H'000E'
TRISA            EQU  H'0012'
TRISC            EQU  H'0014'
LATA             EQU  H'0018'
LATC             EQU  H'001A'

;-----Bank1------------------
PIR0             EQU  H'008C'
PIR1             EQU  H'008D'
PIR2             EQU  H'008E'
PIR3             EQU  H'008F'
PIR4             EQU  H'0090'
PIR5             EQU  H'0091'
PIR6             EQU  H'0092'
PIR7             EQU  H'0093'
PIE0             EQU  H'0096'
PIE1             EQU  H'0097'
PIE2             EQU  H'0098'
PIE3             EQU  H'0099'
PIE4             EQU  H'009A'
PIE5             EQU  H'009B'
PIE6             EQU  H'009C'
PIE7             EQU  H'009D'

;-----Bank2------------------
PMD0             EQU  H'010C'
PMD1             EQU  H'010D'
PMD2             EQU  H'010E'
PMD3             EQU  H'010F'
PMD4             EQU  H'0110'
PMD5             EQU  H'0111'

;-----Bank3------------------
WDTCON0          EQU  H'018C'
WDTCON1          EQU  H'018D'
WDTPS            EQU  H'018E'
WDTPSL           EQU  H'018E'
WDTPSH           EQU  H'018F'
WDTTMR           EQU  H'0190'
BORCON           EQU  H'0191'
PCON0            EQU  H'0192'
PCON1            EQU  H'0193'
TMR0L            EQU  H'019C'
TMR0             EQU  H'019C'
TMR0H            EQU  H'019D'
PR0              EQU  H'019D'
T0CON0           EQU  H'019E'
T0CON1           EQU  H'019F'

;-----Bank4------------------
FVRCON           EQU  H'020C'
CPCON            EQU  H'020D'

;-----Bank5------------------
CPUDOZE          EQU  H'028C'
OSCCON1          EQU  H'028D'
OSCCON2          EQU  H'028E'
OSCCON3          EQU  H'028F'
OSCSTAT          EQU  H'0290'
OSCEN            EQU  H'0291'
OSCTUNE          EQU  H'0292'
OSCFRQ           EQU  H'0293'

;-----Bank6------------------
TMR1             EQU  H'030C'
TMR1L            EQU  H'030C'
TMR1H            EQU  H'030D'
T1CON            EQU  H'030E'
T1GCON           EQU  H'030F'
PR1              EQU  H'030F'
T1GATE           EQU  H'0310'
TMR1GATE         EQU  H'0310'
T1CLK            EQU  H'0311'
TMR1CLK          EQU  H'0311'

;-----Bank7------------------
T2TMR            EQU  H'038C'
TMR2             EQU  H'038C'
T2PR             EQU  H'038D'
PR2              EQU  H'038D'
T2CON            EQU  H'038E'
T2HLT            EQU  H'038F'
T2CLKCON         EQU  H'0390'
T2CLK            EQU  H'0390'
T2RST            EQU  H'0391'

;-----Bank8------------------
CCPR1            EQU  H'040C'
CCPR1L           EQU  H'040C'
CCPR1H           EQU  H'040D'
CCP1CON          EQU  H'040E'
CCP1CAP          EQU  H'040F'
CCPR2            EQU  H'0410'
CCPR2L           EQU  H'0410'
CCPR2H           EQU  H'0411'
CCP2CON          EQU  H'0412'
CCP2CAP          EQU  H'0413'
CCPTMRS0         EQU  H'041F'

;-----Bank10------------------
CLBCON           EQU  H'050C'
CLBSWINU         EQU  H'050D'
CLBSWINH         EQU  H'050E'
CLBSWINM         EQU  H'050F'
CLBSWINL         EQU  H'0510'
CLBCLK           EQU  H'0515'
CLBPPSCON4       EQU  H'0516'
CLBPPSCON3       EQU  H'0517'
CLBPPSCON2       EQU  H'0518'
CLBPPSCON1       EQU  H'0519'

;-----Bank13------------------
CLCNCON          EQU  H'068C'
CLCNPOL          EQU  H'068D'
CLCNSEL0         EQU  H'068E'
CLCNSEL1         EQU  H'068F'
CLCNSEL2         EQU  H'0690'
CLCNSEL3         EQU  H'0691'
CLCNGLS0         EQU  H'0692'
CLCNGLS1         EQU  H'0693'
CLCNGLS2         EQU  H'0694'
CLCNGLS3         EQU  H'0695'
CLCSELECT        EQU  H'0696'
CLCDATA          EQU  H'0697'

;-----Bank14------------------
RC1REG           EQU  H'070C'
TX1REG           EQU  H'070D'
SP1BRG           EQU  H'070E'
SP1BRGL          EQU  H'070E'
SP1BRGH          EQU  H'070F'
RC1STA           EQU  H'0710'
TX1STA           EQU  H'0711'
BAUD1CON         EQU  H'0712'

;-----Bank15------------------
SSP1BUF          EQU  H'078C'
SSP1ADD          EQU  H'078D'
SSP1MSK          EQU  H'078E'
SSP1STAT         EQU  H'078F'
SSP1CON1         EQU  H'0790'
SSP1CON2         EQU  H'0791'
SSP1CON3         EQU  H'0792'

;-----Bank16------------------
CM1CON0          EQU  H'080C'
CM1CON1          EQU  H'080D'
CM1NCH           EQU  H'080E'
CM1PCH           EQU  H'080F'
CM2CON0          EQU  H'0810'
CM2CON1          EQU  H'0811'
CM2NCH           EQU  H'0812'
CM2PCH           EQU  H'0813'
CMOUT            EQU  H'081F'
PWM1DC           EQU  H'0820'
PWM1DCL          EQU  H'0820'
PWM1DCH          EQU  H'0821'
PWM1CON          EQU  H'0822'
PWM2DC           EQU  H'0823'
PWM2DCL          EQU  H'0823'
PWM2DCH          EQU  H'0824'
PWM2CON          EQU  H'0825'
PWMTMRS0         EQU  H'082F'

;-----Bank17------------------
DAC1CON          EQU  H'088C'
DAC1DATL         EQU  H'088D'

